{
  "pt": {
    "name": "Paulo Hasa",
    "greeting": "E aí! Eu sou",
    "professional": "Desenvolvedor",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Inicio",
    "about": "Sobre mim",
    "project": "Projetos",
    "contact": "Contato",
    "about_me_one": "Sou desenvolvedor full stack com mais de 5 anos de experiência em desenvolvimento de software, com forte atuação em front-end, back-end e integração de APIs. Ao longo da minha carreira, trabalhei com princípios de DevOps, ajudando equipes a otimizar processos e implementações. Embora meu foco não seja banco de dados, tenho conhecimento na área e estou sempre buscando expandir minhas habilidades.",
    "about_me_two": "Tive a oportunidade de trabalhar em empresas e como freelancer, o que me permitiu lidar com diferentes desafios e necessidades de clientes. Uma experiência marcante foi meu trabalho em um escritório de contabilidade, onde atuei por mais de um ano com machine learning e automação de processos, ajudando a otimizar e transformar fluxos de trabalho internos.",
    "button_experience": "Explore Minha Trajetória",
    "button_projects": "Acesse Meus Projetos",
    "title_tecnologies": "Tecnologias que Domino",
    "title_experience": "Meu Caminho até Aqui",
    "description_on": "Atualmente, estou trabalhando no desenvolvimento de uma plataforma inovadora que auxilia petrofísicos na interpretação de poços de petróleo por meio de Inteligência Artificial e Machine Learning. Minha responsabilidade principal é liderar o desenvolvimento do front-end da aplicação, garantindo interfaces intuitivas e eficientes, além de integrar APIs que suportam a comunicação entre os módulos da plataforma, contribuindo para uma análise rápida e precisa dos dados.",
    "description_plusoft": "Atuei no projeto iCustomer da Plusoft, uma plataforma que integrava, via API, as interações dos usuários em redes sociais com os clientes da empresa. Fui responsável tanto pela sustentação do sistema quanto pela implementação de novas funcionalidades, desenvolvidas a partir de sugestões dos clientes e da equipe interna. Contribuí para garantir a estabilidade, a performance e a evolução contínua da plataforma, sempre buscando soluções eficientes e alinhadas às necessidades dos usuários.",
    "description_roma": "No Grupo Roma, atuei na automação de sistemas, desenvolvendo scripts em Python e VBA para automatizar a inserção de dados de clientes no sistema interno da empresa. Trabalhei com diversas fontes de dados, como planilhas Excel, arquivos PDF e TXT, otimizando processos internos e facilitando o trabalho dos contadores. Além disso, prestei serviços externos, desenvolvendo microsistemas sob medida para pequenas empresas, sempre focando em eficiência, precisão e automação de tarefas repetitivas.",
    "description_freelancer": "Com mais de 5 anos de experiência, crio aplicações web robustas, escaláveis e intuitivas, unindo interfaces elegantes no front-end e arquiteturas sólidas no back-end. Especializado em React.js, JavaScript, Python, Django, Docker e integração de APIs, ajudo empresas a alcançar seus objetivos através de soluções sob medida, com deploys ágeis e suporte contínuo. Se você busca alguém para transformar sua ideia em realidade digital, estou pronto para o desafio.",
    "title_freelancer": "Transformando Ideias em Soluções Digitais",
    "skills": "Competências",
    "explore_project": "Explore o Projeto",
    "project_details_wellnova_title": "Análise Petrofísica com IA",
    "project_details_wellnova": "A plataforma Wellnova foi desenvolvida para auxiliar petrofísicos na interpretação da integridade do cimento em poços de petróleo. O projeto evoluiu para incluir visualização interativa de logs, simulações avançadas e outras funcionalidades essenciais, proporcionando uma experiência intuitiva e eficiente para os usuários. Neste projeto, sou responsável pelo desenvolvimento front-end e integração de APIs.",
    "project_details_digitalpm_title": "Gerenciamento de projetos",
    "project_details_digitalpm": "O Project Manager foi desenvolvido para atender à alta demanda e ao gerenciamento eficiente de projetos de P&D na Ouronova. A plataforma permite que os gestores administrem tanto a parte financeira quanto a equipe do projeto, complementando as funções de recursos humanos. Além disso, o sistema possibilita a realização de avaliações de desempenho, feedback contínuo e o controle completo do progresso dos projetos, incluindo a gestão rigorosa de prazos e entregas."
  },
  "en": {
    "name": "Paulo Hasa",
    "greeting": "Hello, I am",
    "professional": "Developer",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Home",
    "about": "About me",
    "project": "Project",
    "contact": "Contact",
    "about_me_one": "I am a full stack developer with over 5 years of experience in software development, with a strong focus on front-end, back-end, and API integration. Throughout my career, I have worked with DevOps principles, helping teams optimize processes and deployments. Although databases are not my main focus, I have knowledge in the area and am always seeking to expand my skills.",
    "about_me_two": "I have had the opportunity to work for companies and as a freelancer, which allowed me to handle various challenges and client needs. A notable experience was my work at an accounting firm, where I worked for over a year with machine learning and process automation, helping to optimize and transform internal workflows.",
    "button_experience": "Explore My Journey",
    "button_projects": "Access My Projects",
    "title_tecnologies": "Technologies I Master",
    "title_experience": "My Journey So Far",
    "description_on": "Currently, I am working on the development of an innovative platform that assists petrophysicists in well interpretation using Artificial Intelligence and Machine Learning. My main responsibility is leading the front-end development of the application, ensuring intuitive and efficient interfaces, as well as integrating APIs that support communication between the platform’s modules, contributing to fast and accurate data analysis.",
    "description_plusoft": "I worked on the iCustomer project at Plusoft, a platform that integrated, via API, user interactions from social media with the company’s clients. I was responsible for both system maintenance and the implementation of new features, developed based on suggestions from clients and the internal team. I contributed to ensuring the platform’s stability, performance, and continuous evolution, always seeking efficient solutions aligned with user needs.",
    "description_roma": "At Grupo Roma, I worked on system automation by developing Python and VBA scripts to automate the insertion of client data into the company's internal system. I handled various data sources such as Excel spreadsheets, PDF, and TXT files, optimizing internal processes and facilitating the work of accountants. Additionally, I provided external services by developing tailored microsystems for small businesses, always focusing on efficiency, accuracy, and automation of repetitive tasks.",
    "title_freelancer": "Turning Ideas into Digital Solutions",
    "description_freelancer": "With over 5 years of experience, I build robust, scalable, and intuitive web applications, combining elegant front-end interfaces with solid back-end architectures. Specialized in React.js, JavaScript, Python, Django, Docker, and API integration, I help companies achieve their goals through tailor-made solutions, with agile deployments and continuous support. If you're looking for someone to turn your idea into a digital reality, I’m ready for the challenge.",
    "skills": "Skills",
    "explore_project": "Explore the Project",
    "project_details_wellnova_title": "AI-Powered Petrophysical Analysis",
    "project_details_wellnova": " The Wellnova platform was developed to assist petrophysicists in interpreting the cement integrity in oil wells. The project evolved to include interactive log visualization, advanced simulations, and other essential features, providing an intuitive and efficient experience for users. In this project, I am responsible for front-end development and API integration.",
    "project_details_digitalpm_title": "Project Management",
    "project_details_digitalpm": "The Project Manager was developed to meet the high demand and efficient management of R&D projects at Ouronova. The platform enables managers to handle both the financial aspect and the project team, complementing human resources functions. Additionally, the system allows for performance evaluations, continuous feedback, and full control of project progress, including strict management of deadlines and deliveries."
  },
  "es": {
    "name": "Paulo Hasa",
    "greeting": "Hola, soy",
    "professional": "Desarrollador",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Inicio",
    "about": "Sobre mí",
    "project": "Proyecto",
    "contact": "Contacto",
    "about_me_one": "Soy desarrollador full stack con más de 5 años de experiencia en desarrollo de software, con un enfoque fuerte en front-end, back-end y integración de APIs. A lo largo de mi carrera, he trabajado con principios de DevOps, ayudando a equipos a optimizar procesos e implementaciones. Aunque las bases de datos no son mi enfoque principal, tengo conocimientos en el área y siempre busco expandir mis habilidades.",
    "about_me_two": "Tuve la oportunidad de trabajar en empresas y como freelancer, lo que me permitió manejar diversos desafíos y necesidades de clientes. Una experiencia destacada fue mi trabajo en una firma contable, donde trabajé durante más de un año con machine learning y automatización de procesos, ayudando a optimizar y transformar los flujos de trabajo internos.",
    "button_experience": "Ver Más Sobre Mi Experiencia",
    "button_projects": "Explora Mi Trayectoria",
    "title_tecnologies": "Tecnologías que Domino",
    "title_experience": "Mi Camino Hasta Aquí",
    "description_on": "Actualmente, estoy trabajando en el desarrollo de una plataforma innovadora que ayuda a los petrofísicos en la interpretación de pozos de petróleo mediante Inteligencia Artificial y Aprendizaje Automático. Mi principal responsabilidad es liderar el desarrollo del front-end de la aplicación, garantizando interfaces intuitivas y eficientes, además de integrar APIs que permiten la comunicación entre los módulos de la plataforma, contribuyendo a un análisis de datos rápido y preciso.",
    "description_plusoft": "Trabajé en el proyecto iCustomer de Plusoft, una plataforma que integraba, mediante API, las interacciones de los usuarios en redes sociales con los clientes de la empresa. Fui responsable tanto del mantenimiento del sistema como de la implementación de nuevas funcionalidades, desarrolladas a partir de sugerencias de los clientes y del equipo interno. Contribuí a garantizar la estabilidad, el rendimiento y la evolución continua de la plataforma, buscando siempre soluciones eficientes y alineadas con las necesidades de los usuarios.",
    "description_roma": "En Grupo Roma, trabajé en la automatización de sistemas, desarrollando scripts en Python y VBA para automatizar la inserción de datos de clientes en el sistema interno de la empresa. Gestioné diversas fuentes de datos como hojas de cálculo de Excel, archivos PDF y TXT, optimizando los procesos internos y facilitando el trabajo de los contadores. Además, brindé servicios externos desarrollando microsistemas a medida para pequeñas empresas, siempre enfocado en la eficiencia, precisión y automatización de tareas repetitivas.",
    "title_freelancer": "Transformando Ideas en Soluciones Digitales",
    "description_freelancer": "Con más de 5 años de experiencia, desarrollo aplicaciones web sólidas, escalables e intuitivas, combinando interfaces front-end elegantes con arquitecturas back-end robustas. Especializado en React.js, JavaScript, Python, Django, Docker e integración de APIs, ayudo a las empresas a alcanzar sus objetivos mediante soluciones personalizadas, con despliegues ágiles y soporte continuo. Si buscas a alguien para convertir tu idea en una realidad digital, estoy listo para el desafío.",
    "skills": "Competencias",
    "explore_project": "Explora el Proyecto",
    "project_details_wellnova_title": "Análisis Petrofísico con IA",
    "project_details_wellnova": "La plataforma Wellnova fue desarrollada para ayudar a los petrofísicos en la interpretación de la integridad del cemento en pozos de petróleo. El proyecto evolucionó para incluir visualización interactiva de registros, simulaciones avanzadas y otras funcionalidades esenciales, proporcionando una experiencia intuitiva y eficiente para los usuarios. En este proyecto, soy responsable del desarrollo front-end y la integración de APIs.",
    "project_details_digitalpm_title": "Gestión de Proyectos",
    "project_details_digitalpm": "El Project Manager fue desarrollado para atender la alta demanda y la gestión eficiente de proyectos de I+D en Ouronova. La plataforma permite que los gestores administren tanto el aspecto financiero como el equipo del proyecto, complementando las funciones de recursos humanos. Además, el sistema permite realizar evaluaciones de desempeño, retroalimentación continua y el control completo del progreso de los proyectos, incluyendo la gestión rigurosa de plazos y entregas."
  }
}